function infoIkabog() {
    swal({
      title: "О книге",
      text: "Когда-то королевство Корникопия было самым богатым и счастливым в мире. Король славился невообразимо красивыми усами. Кондитеры, колбасники, сыровары и виноделы изобретали такие вкусные лакомства и напитки, что те, кому посчастливилось их отведать, плакали от счастья. Страна процветала, народ радовался. Всё бы хорошо, но в туманном, мрачном Смурланде, расположенном на севере королевства, ходили слухи об Икабоге, страшном болотном чудовище. Никто не верил в существование монстра из детской сказки, пока однажды ночной кошмар не стал явью...",
      button: "Закрыть",
    });
    }
  
    function infoKingdom() {
      swal({
        title: "О книге",
        text: "В норвежском городке, затерянном в горах, течет сонная мирная жизнь. И она вполне устраивает Роя, который тут родился и вырос, но на его пороге появляется возмутитель спокойствия — младший брат Карл, успешный, предприимчивый, дерзкий. Он приехал со своей новой женой, довольно странной особой, — и с грандиозными планами строительства отеля в целях возрождения города. Но, во-первых, на поверку планы Карла оказались далеко не так благородны, во-вторых, Рой понимает, что его неудержимо тянет к жене брата, в-третьих, темные тайны прошлого, казалось, похороненные навсегда, начинают всплывать на поверхность...",
        button: "Закрыть",
      });
      }
  
      function infoHoliday() {
        swal({
          title: "О книге",
          text:"Какой праздник на вкус? Пахнет ли он корицей, сладкой выпечкой или шоколадом? Согласитесь, зайти домой и почувствовать, что из кухни доносится аромат чего-то неимоверно вкусного: свежеиспеченного медового торта или имбирного печенья, - вот что переполняет счастьем, вызывает улыбку и пробуждает аппетит...",
          button: "Закрыть",
      });
      }
      function infoHouseInWhich() {
        swal({
          title: "О книге",
          text:"На окраине города, среди стандартных новостроек, стоит Серый Дом, в котором живут Сфинкс, Слепой, Лорд, Табаки, Македонский, Черный и многие другие. Неизвестно, действительно ли Лорд происходит из благородного рода драконов, но вот Слепой действительно слеп, а Сфинкс - мудр. Табаки, конечно, не шакал, хотя и любит поживиться чужим добром. Для каждого в Доме есть своя кличка, и один день в нем порой вмещает столько, сколько нам, в Наружности, не прожить и за целую жизнь. Каждого Дом принимает или отвергает. Дом хранит уйму тайн, и банальные скелеты в шкафах - лишь самый понятный угол того незримого мира, куда нет хода из Наружности, где перестают действовать привычные законы пространства-времени. Дом - это нечто гораздо большее, чем интернат для детей, от которых отказались родители. Дом - это их отдельная вселенная...",
          button: "Закрыть",
      });
      }
      function infoMeterApart() {
        swal({
          title: "О книге",
          text:"Можно ли влюбиться в кого-то, кого ты никогда не сможешь обнять? Парень и девушка. Любовь с первого взгляда. Любовь, которой даже смертельная болезнь не сможет помешать. Стелла и Уилл бросают вызов судьбе и идут наперекор всем. Они встретились, когда больше всего нуждались в этом. Вот только их любовь обречена, ведь Уилл никогда не сможет коснуться Стеллы. Его прикосновение смертельно для девушки. Но истинная любовь не знает ни границ, ни запретов, и она определенно стоит целой жизни...",
          button: "Закрыть",
      });
      }
  
  
      function infoWorldCats() {
        swal({
          title: "О книге",
          text:"Несмотря на долгую историю сосуществования, кошкам, получающим уход и заботу человека, удалось сохранить загадочность и дистанцию в этих отношениях. Автор книги раскрывает роль кошек в культуре и мифологии разных стран и эпох, доказывает наличие у кошек сверхъестественных способностей и заставляет читателя по-новому взглянуть на этих привычных существ...",
          button: "Закрыть",
      });
      }
      function infoWhisperingSkull() {
        swal({
          title: "О книге",
          text:"Кажется, наши задания раз от раза становятся сложнее. В одной из могил, которую нам пришлось вскрыть, было обнаружено древнее костяное зеркало, обладающее чудовищной силой. Все, кто когда либо в него смотрел, умирали в страшных мучениях. Поговаривают, что его создал свихнувшийся некромант из самых настоящих человеческих костей. Бр-р-р! Лучше даже не думать об этом. Теперь мне, Локвуду и Джорджу предстоит не только разобраться с этой смертельной загадкой, но и устоять перед искушением самим заглянуть в страшное зеркало, которое, кажется, обладает собственной волей. Короче говоря, очередное дело для чокнутых агентов!",
          button: "Закрыть",
      });
      }
      function infoTellingStories() {
        swal({
          title: "О книге",
          text:"Десять лет прошло с тех пор, как Джини Лонг обвинили в убийстве пятнадцатилетней Эбигейл Мэнтел. А теперь обитатели йоркширской деревни Элвет с ужасом узнают, что появились новые улики, свидетельствующие о невиновности Джини. Значит, убийца Эбигейл все еще на свободе. Для Эммы Беннетт это открытие означает возвращение воспоминаний о жизнерадостной подруге – и о жутком зимнем дне, когда она обнаружила ее тело, лежащее в холодной канаве. Инспектор Вера Стэнхоуп начинает новое расследование в прибрежной деревне, и ее жители вынуждены вернуться в то время, о котором они надеялись забыть...",
          button: "Закрыть",
      });
      }
      function infoMaraAndMorok() {
        swal({
          title: "О книге",
          text:"После предательства Морока Мара живой попадает в руки потомков своего врага. Ей придётся лицом к лицу встретиться с Северином — нынешним королём Серата — и узнать, какую судьбу он приготовил для неё. Ей предстоит разобраться в том, как много лжи таится в её прошлом и настоящем. Ей необходимо найти способ завершить свою давнюю месть...",
          button: "Закрыть",
      });
      }
      function infoAdventureTime() {
        swal({
          title: "О книге",
          text:"Что случится, если все жители Ооо вдруг забудут, как готовить еду? Хватит сил у Финна и Джейка, чтобы спасти друзей? И самое главное, сколько времени потребуется Конфетному народу, чтобы осознать, что они... конфеты?! В этой бешеной гонке со временем только Джейк и живущий в его подсознании сэндвич знают, как всех спасти или хотя бы накормить...",
          button: "Закрыть",
      });
      }